Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Reset: If SetTimer is used on an existing timer, the timer is reset (unless Priority is specified and Period is omitted); in other words, the entirety of its period must elapse before its function will be called again.
ja: リセット：SetTimerを既存のタイマーに使用した場合、タイマーはリセットされる（Priorityが指定され、Periodが省略された場合を除く）、言い換えれば、その関数が再び呼び出される前にその期間の全体が経過する必要がある。

source: Resize: Makes the window resizable and enables its maximize button in the title bar.
ja: Resize：ウィンドウのサイズを変更できるようにし、タイトルバーの最大化ボタンを有効にします。

source: Restore: Unminimizes or unmaximizes the window, if necessary.
ja: Restore：必要に応じて、ウィンドウの最小化または最大化を解除します。

source: Retrieving the contents of variables: To include the contents of a variable in a string, use concatenation or Format.
ja: 変数の内容の取得：変数の内容を文字列に含めるには、連結かFormat関数を使います。

source: Reverse direction: To remap some other key to become a "mystery key", follow this example:
ja: 逆方向：他のキーを「ミステリー・キー」にリマップするには、次のようにします：

source: Reverse direction:
ja: 逆方向

source: Right-click: Within an open Explorer window, right-click any .ahk file and select "Compile Script" (only available if the script compiler option was chosen when AutoHotkey was installed).
ja: 右クリックします：開いているエクスプローラウィンドウで、任意の.ahkファイルを右クリックし、「Compile Script」を選択します（AutoHotkeyのインストール時にスクリプトコンパイラオプションが選択されている場合のみ使用可能）。

source: Right: Right-aligns the column's text.
ja: Right：カラムのテキストを右寄せにします。

source: Right: Right-justifies the control's text within its available width.
ja: Right：コントロールのテキストを使用可能な幅の範囲内で右寄せにします。

source: Right: The item is right-justified within the menu bar.
ja: Right：メニューバー内で項目が右寄せになります。

source: Robert Yaklin: A lot of tireless testing to isolate bugs, a great first draft of the installer, as well as great suggestions for how commands ought to work :)
ja: Robert Yaklin：バグの切り分けのためのたゆまぬテストの数々、インストーラーの素晴らしい初稿、そしてコマンドがどのように機能すべきかについての素晴らしい提案 :)

source: RootDir: The root (starting) directory, which is assumed to be a subfolder in A_WorkingDir if an absolute path is not specified.
ja: RootDir：ルート（開始）ディレクトリ。絶対パスが指定されていない場合は、A_WorkingDirのサブフォルダとみなされます。

source: Russell Davis: For developing A_PriorKey, ahk_path (the basis of ahk_exe in WinTitle parameters), #InputLevel and SendLevel.
ja: Russell Davis：A_PriorKey、ahk_path（WinTitleパラメータのahk_exeの基礎）、#InputLevel、SendLevelの開発について。

source: S: Save dialog.
ja: S：保存ダイアログです。

source: S: Size (in points).
ja: S：サイズ（単位：ポイント）。

source: S: Suppresses (blocks) the key after processing it.
ja: S：キーを処理した後、サプレス（ブロック）します。

source: S or S0:
ja: S または S0：

source: S or S0: Specify the letter S to make the hotkey exempt from Suspend, which allows the hotkey to be used to turn Suspend off.
ja: S または S0：Sを指定すると、ホットキーがサスペンドを免除するようになり、サスペンドをオフにするためにホットキーを使用できるようになります。

source: S or S0: Specify the letter S to make the hotstring exempt from Suspend.
ja: S または S0：ホットストリングをサスペンド対象外にする場合は、Sを指定します。

source: S or Selected:
ja: S または Selected：

source: S or Selected: The count includes only the selected/highlighted rows.
ja: S または Selected：カウントは選択/ハイライトされた行のみを含みます。

source: SC159::MsgBox ThisHotkey " was pressed." ; Replace 159 with your key's value.
ja: SC159::MsgBox ThisHotkey " was pressed." ; 159をキーの値で置き換えます。

source: SI or SP or SE:
ja: SI または SP または SE：

source: SI or SP or SE: Sets the method by which auto-replace hotstrings send their keystrokes.
ja: SI または SP または SE：自動置換ホットストリングがキー入力を送信する方法を設定します。

source: SafeArray: If the flag is set, the SafeArray is destroyed when the wrapper object is freed.
ja: SafeArray：このフラグが設定されている場合、SafeArrayはラッパーオブジェクトが解放される際に破棄されます。

source: Scope: Each function has its own list of local labels.
ja: スコープ：各関数はローカルラベルのリストを持つ。

source: Screen: Coordinates are relative to the desktop (entire screen).
ja: Screen：座標はデスクトップ（画面全体）に対する相対座標です。

source: Script Filename: This can be omitted if there are no Script Parameters.
ja: スクリプトファイル名： スクリプトパラメータがない場合は省略可能。

source: Script Parameters: The string(s) you want to pass into the script, with each separated from the next by one or more spaces.
ja: スクリプトのパラメータ：スクリプトに渡す文字列を、空白で区切って指定します。

source: Sean: For developing built-in COM functionality and providing valuable insight into COM.
ja: Sean：ビルトインのCOM機能を開発し、COMに関する貴重な洞察を提供してくれた。

source: Section: Starts a new section and saves this control's position for later use with the XS and YS positioning options described above.
ja: Section：新しいセクションを開始し、このコントロールの位置を保存して、後で上記のXSとYSの位置決めオプションで使用できるようにします。

source: See Also:
ja: 参照：

source: Select: Selects the item.
ja: Select：項目を選択します。

source: Select: Selects the row.
ja: Select：行を選択します。

source: Selected: Returns only the selected (highlighted) rows rather than all rows.
ja: Selected：すべての行ではなく、選択された（ハイライトされた）行のみを返します。

source: Send: Send, ControlSend and related often release modifier keys as part of their normal operation.
ja: 送信： Send、ControlSendと関連するものは、通常の操作の一部として修飾キーを解放することが多い。

source: Send: By default, Send is synonymous with SendInput; but it can be made a synonym for SendEvent or SendPlay via SendMode.
ja: Send：デフォルトでは、SendはSendInputと同義ですが、SendModeによってSendEventやSendPlayと同義にすることができます。

source: Send: The user's keyboard and mouse input is ignored while a SendEvent is in progress (including Send and SendText if SendMode "Event" has been used).
ja: Send：SendEvent（SendMode "Event"が使用されている場合はSendと SendTextを含む）の実行中は、ユーザーのキーボードとマウス入力は無視されます。

source: SendAndMouse: A combination of the above two modes.
ja: SendAndMouse：上記2つのモードを組み合わせたもの。

source: SendEvent: SendEvent sends keystrokes using the Windows keybd_event function (search Microsoft Docs for details).
ja: SendEvent：SendEventは、Windowsのkeybd_event関数（詳細はMicrosoft Docsを検索）を使用してキーストロークを送信します。

source: SendInput and SendPlay:
ja: SendInput および SendPlay:

source: SendInput and SendPlay: SendInput and SendPlay use the same syntax as SendEvent but are generally faster and more reliable.
ja: SendInput、SendPlay：SendInputとSendPlayはSendEventと同じ構文を使用しますが、一般的により高速で信頼性が高いです。

source: SendText: Similar to Send, except that all characters in Keys are interpreted and sent literally.
ja: SendText：Sendと似ていますが、Keysのすべての文字が解釈され、文字通り送信されます。

source: Set: The function object to call when the property is assigned a value.
ja: Set：プロパティに値が割り当てられたときに呼び出される関数オブジェクトです。

source: Set a property, denoted by :=.
ja: :=で示されるプロパティを設定します。

source: Setup hangs: If the setup window comes up blank or not at all, try one or both of the following:
ja: セットアップがハングアップします。セットアップウィンドウが真っ白になったり、まったく表示されない場合は、次のいずれかまたは両方を試してみてください。

source: ShiftAltTab: Same as above except move backward in the menu.
ja: ShiftAltTab：上と同じですが、前のウィンドウを選択します。

source: Sleep -1: A delay of -1 does not sleep but instead makes the script immediately check its message queue.
ja: Sleep -1：ディレイを-1にすると、スクリプトはスリープせず、すぐにメッセージキューをチェックするようになる。

source: Slow: Can be much slower, but works with all controls which respond to the WM_GETTEXT message.
ja: Slow：かなり遅くなるが、WM_GETTEXTメッセージに応答するすべてのコントロールで動作する。

source: Slow: Uses a more elaborate method to retrieve the color, which may work in certain full-screen applications when the other methods fail.
ja: Slow：より精巧な方法で色を取得します。これは、特定のフルスクリーンアプリケーションで、他の方法が失敗した場合に機能する可能性があります。

source: Sort: For the Modify method, this option alphabetically sorts the children of the specified item.
ja: Sort： Modify メソッドの場合、このオプションは、指定された項目の子をアルファベット順に並べ替えます。

source: Sort: Immediately sorts the column in ascending order (even if it has the Desc option).
ja: Sort：カラムを即座に昇順でソートします（Descオプションがあっても）。

source: Sort: The control is kept alphabetically sorted according to the contents of the first column.
ja: Sort：コントロールは、最初のカラムの内容に従ってアルファベット順にソートされた状態で保持されます。

source: SortDesc: Immediately sorts the column in descending order.
ja: SortDesc：カラムをすぐに降順にソートします。

source: SortDesc: Same as above except in descending order.
ja: SortDesc：降順以外は上記と同じ。

source: Spaces are mostly ignored: Indentation (leading space) is important for writing readable code, but is not required by the program and is generally ignored.
ja: スペースの殆どは無視：インデント（先頭の空白）は、読みやすいコードを書くために重要ですが、プログラムでは必要とされないので、一般的には無視されます。

source: Stack: A string representing the call stack at the time the Error object was constructed.
ja: Stack：Errorオブジェクトが構築された時点のコールスタックを表す文字列です。

source: Standard Output (stdout): Specifying an asterisk (*) for Filename causes Text to be sent to standard output (stdout).
ja: 標準出力（stdout）：Filenameにアスタリスク（*）を指定すると、Textは標準出力（stdout）に送られます。

source: Standard Output (stdout): Specifying an asterisk (*) for OutputFile sends any text written by FileAppend to standard output (stdout).
ja: 標準出力（stdout）：OutputFileにアスタリスク（*）を指定すると、FileAppendで書き込んだテキストを標準出力（stdout）に出力します。

source: Standard Output (stdout):
ja: 標準出力（stdout）：

source: StdOut: Send a description of the warning to stdout (the program's standard output stream), along with the filename and line number.
ja: StdOut：警告の説明をファイル名と行番号とともに標準出力（プログラムの標準出力ストリーム）に送信します。

source: Steve Gray (Lexikos): For developing dynamic function calling and other new functionality; analyzing and fixing bugs; and valuable support and advice for hundreds of individual visitors at the forum.
ja: Steve Gray（Lexikos）：ダイナミックな関数呼び出しやその他の新機能の開発、バグの分析と修正、フォーラムでの何百人ものビジターへの貴重なサポートとアドバイス。

source: Storing the result of an expression: To assign a result to a variable, use the colon-equal operator (:=).
ja: 式の結果の格納：結果を変数に代入するには、コロンと等号の演算子（:=）を使います。

source: Storing values in variables: To store a string or number in a variable, use the colon-equal operator (:=) followed by a number, quoted string or any other type of expression.
ja: 変数への値の格納：文字列や数値を変数に格納するには、コロンと等号の演算子（:=）の後に数値や引用符で囲まれた文字列、その他の型の式を続けます。

source: Substitutes for Alt-Tab: Hotkeys can provide an alternate means of alt-tabbing.
ja: Alt-Tabの代替：ホットキーは、Alt-Tabの代替手段を提供することができます。

source: Support for URLs: If Path contains a colon-double-slash, such as in "https://domain.com" or "ftp://domain.com", OutDir is set to the protocol prefix + domain name + directory (e.g. https://domain.com/images) and OutDrive is set to the protocol prefix + domain name (e.g. https://domain.com).
ja: URLのサポート： Pathが "https://domain.com"や"ftp://domain.com"のようにコロン-ダブルスラッシュを含む場合、OutDirはプロトコルプレフィックス+ドメイン名+ディレクトリ（例：https://domain.com/images）に設定され、OutDriveはプロトコルプレフィックス+ドメイン名（例：https://domain.com）に設定されます。

source: Switches: Zero or more of the following:
ja: Switches：以下のうち0個以上：

source: Syntax errors: If the pattern contains a syntax error, an Error is thrown with a message in the following form:
ja: シンタックスエラーパターンに構文エラーが含まれる場合、以下のようなメッセージとともにErrorが投げられる：

source: Syntax errors: If the pattern contains a syntax error, an Error is thrown with a message in the following form: Compile error N at offset M: description.
ja: シンタックスエラー：パターンに構文エラーが含まれる場合、以下のようなメッセージとともにErrorが投げられる：Compile error N at offset M: description。

source: SysMenu (present by default):
ja: SysMenu（デフォルトで存在）：

source: SysMenu (present by default): Specify -SysMenu (minus SysMenu) to omit the system menu and icon in the window's upper left corner.
ja: SysMenu（デフォルトで存在）：ウィンドウ左上のシステムメニューとアイコンを省略する場合は、-SysMenu（マイナスSysMenu）を指定します。

source: T: Retrieve the toggle state.
ja: T：トグル状態を取得します。

source: T: Send the replacement text using Text mode.
ja: T：テキストモードを使って、置換テキストを送信します。

source: T: Sets Timeout (e.g. T3 or T2.5).
ja: T：タイムアウトを設定します（例：T3またはT2.5）。

source: T: Specifies the timeout in seconds.
ja: T：タイムアウトを秒単位で指定します。

source: T: Timeout.
ja: T：タイムアウト。

source: Tn: Specifies the timeout in seconds.
ja: Tn：タイムアウトまでの時間を秒で指定します。

source: Tn: Specify the letter T followed by a the number of threads to allow for this hotkey as described in #MaxThreadsPerHotkey.
ja: Tn:MaxThreadsPerHotkeyで説明したように、このホットキーで許可するスレッド数を文字Tの後に続けて指定します。

source: Target: The target of a label is the next line of executable code.
ja: ターゲット：ラベルのターゲットは実行コードの次の行である。

source: TargetError: A function failed because its target could not be found.
ja: TargetError：ターゲットが見つからなかったため、関数が失敗しました。

source: Ternary operator.
ja: 三項演算子。

source: Text: Changes the column back to text-mode sorting, which is the initial default for every column.
ja: Text：カラムをテキストモードでのソートに戻します（すべてのカラムの初期設定）。

source: Text (String):
ja: Text（文字列）：

source: Text (String): The control's text.
ja: Text（文字列）：コントロールのテキストです。

source: Thaddeus Beck (Beardboy): For NT4 testing to fix GetKeyState and the Send command; for a lot of help on the forum; and for many suggestions and bug reports.
ja: Thaddeus Beck (Beardboy)：GetKeyStateとSendコマンドを修正するためのNT4テスト、フォーラムでの多くの助け、そして多くの提案とバグ報告。

source: The Close button (in the message box's title bar): Since the message box is a built-in feature of the operating system, its X button is enabled only when certain buttons are present.
ja: 閉じるボタン（メッセージボックスのタイトルバー内）：メッセージボックスはOSの組み込み機能なので、そのXボタンは特定のボタンが存在する場合にのみ有効になります。

source: The Close button (in the message box's title bar):
ja: 閉じるボタン（メッセージボックスのタイトルバー内）：

source: The Help button: When the Help button option (16384) is present in Options, pressing the Help button will have no effect unless both of the following are true:
ja: ヘルプボタン：Optionsでヘルプボタンオプション（16384）がある場合、以下の両方が成立していないと、ヘルプボタンを押しても効果がありません：

source: The prefix key loses its native function: In the above example, Numpad0 becomes a prefix key; but this also causes Numpad0 to lose its original/native function when it is pressed by itself.
ja: プレフィックスキーが本来の機能を失う。上記の例では、Numpad0がプレフィックスキーになりますが、Numpad0が単独で押された場合、本来の機能を失うことになります。

source: TheGood: For merging the documentation and adapting the installer script.
ja: TheGood：ドキュメントをマージし、インストーラースクリプトを適合させる。

source: Theme: By specifying -Theme, all subsequently created controls in the window will have the Classic Theme appearance.
ja: Theme：Themeを指定すると、その後に作成されるウィンドウ内のコントロールはすべてクラシックテーマの外観となります。

source: Theme: This option can be used to override the window's current theme setting for the newly created control.
ja: Theme：このオプションを使用すると、ウィンドウの現在のテーマ設定を、新しく作成されたコントロールに上書きすることができます。

source: This is important: A lot of games, especially modern ones, have cheat prevention software.
ja: これは重要なことだ。多くのゲーム、特に最近のゲームには、チート防止ソフトが搭載されている。

source: Thread "Priority", Level
ja: スレッド「優先度」、レベル

source: Tile: Shows a large-icon view but with ergonomic differences such as displaying each item's text to the right of the icon rather than underneath it.
ja: Tile：大きなアイコンで表示されますが、各項目のテキストがアイコンの下ではなく右側に表示されるなど、人間工学的な違いがあります。

source: TimeoutError: SendMessage timed out.
ja: TimeoutError：SendMessageがタイムアウトしました。

source: Timer precision: Due to the granularity of the OS's time-keeping system, Period is typically rounded up to the nearest multiple of 10 or 15.6 milliseconds (depending on the type of hardware and drivers installed).
ja: タイマー精度：OSの時間管理システムの粒度のため、Periodは通常10または15.6ミリ秒の最も近い倍数に切り上げられます（インストールされているハードウェアとドライバの種類に依存します）。

source: Tip: AutoHotkey comes with a script called Window Spy, which can be used to confirm the title, class and process name of a window.
ja: ヒント：AutoHotkeyには、ウィンドウのタイトル、クラス、プロセス名を確認するために使用できるWindow Spyというスクリプトが付属しています。

source: Tip: For COM interfaces defined by Microsoft, try searching the Internet or Windows SDK for "IInterfaceNameVtbl" - for example, "IUnknownVtbl".
ja: ヒント：Microsoftによって定義されたCOMインターフェースについては、インターネットまたはWindows SDKで「IInterfaceNameVtbl」-例えば「IUnknownVtbl」を検索してみてください。

source: Tip: If your browser supports it, you can download any code block (such as the one above) as a script file by clicking the ↓ button which appears in the top-right of the code block when you hover your mouse over it.
ja: ヒント：ブラウザがサポートしていれば、コードブロックの右上にマウスカーソルを置くと表示される「↓」ボタンをクリックすることで、上記のようなコードブロックをスクリプトファイルとしてダウンロードすることができます。

source: Tip: If your browser supports it, you can download any code block (such as the one above) as a script file by clicking the button which appears in the top-right of the code block when you hover your mouse over it.
ja: ヒント:ブラウザがサポートしていれば、コードブロックの右上にマウスカーソルを置くと表示されるボタンをクリックすることで、上記のようなコードブロックをスクリプトファイルとしてダウンロードすることができます。

source: Tip: Since an IF-statement sees any non-zero value as "true", if TV.Get(ItemID, "Checked") = ItemID and if TV.Get(ItemID, "Checked") are functionally identical.
ja: ヒント：IFステートメントは、ゼロでない値を "true"とみなすので、TV.Get(ItemID, "Checked") = ItemIDと TV.Get(ItemID, "Checked")は機能的に同じである。

source: Titan/polyethene: For providing community hosting on autohotkey.net, creating many useful scripts and libraries, creating the JavaScript to colorize code-comments in the forum, and many other things.
ja: Titan/polyethene：autohotkey.netでのコミュニティホスティングの提供、多くの有用なスクリプトやライブラリの作成、フォーラムでのコードコメントに色をつけるJavaScriptの作成、その他多くのことに貢献しました。

source: Tn: Time options.
ja: Tn：時間の選択肢がある。

source: To hold down or release a key: Enclose in braces the name of the key followed by the word Down or Up.
ja: キーを押したままにしたり離したりするには：キーの名前の後にDownまたはUpという単語を中括弧で囲みます。

source: To repeat a keystroke: Enclose in braces the name of the key followed by the number of times to repeat it.
ja: キー操作のリピート：中括弧で囲んで、キーの名前と、それを繰り返す回数を指定します。

source: To repeat a keystroke:
ja: キー操作のリピート

source: Toggle: The hotkey is set to the opposite state (enabled or disabled).
ja: Toggle：ホットキーが反対の状態（有効または無効）に設定されます。

source: Toggle or -1:
ja: Toggle または -1:

source: Toggle or -1: Sets the hotstring to the opposite state (enabled or disabled).
ja: Toggle または -1：ホットストリングを反対の状態（有効または無効）に設定します。

source: ToolTip: Affects ToolTip.
ja: ToolTip：ToolTipに影響します。

source: ToolWindow: Provides a narrower title bar but the window will have no taskbar button.
ja: ToolWindow：タイトルバーの幅が狭くなりますが、ウィンドウにタスクバーボタンが表示されなくなります。

source: True divide (/): True division yields a floating point result even when both inputs are integers.
ja: 真の除算（/）：真の除算は、両方の入力が整数の場合でも浮動小数点数の結果を返す。

source: True or 1 to enable exemption for subsequent hotkeys, or False or 0 to disable exemption.
ja: 後続のホットキーの免除を有効にする場合はTrueまたは1、免除を無効にする場合はFalseまたは0となります。

source: True or 1:
ja: Trueまたは1：

source: True or 1: All hotkey subroutines between here and the next #MaxThreadsBuffer False directive will buffer rather than ignore presses of their hotkeys whenever their subroutines are at their #MaxThreadsPerHotkey limit.
ja: True または 1：ここから次の#MaxThreadsBuffer False指令までのすべてのホットキーサブルーチンは、そのサブルーチンが#MaxThreadsPerHotkeyの限界に達したときに、ホットキーの押下を無視するのではなく、バッファリングします。

source: True or 1: Enables exemption for subsequent hotkeys and hotstrings.
ja: True または 1：後に続くホットキーとホットストリングの例外を有効にします。

source: True or 1: The keyboard hook will be used to implement all keyboard hotkeys between here and the next #UseHook False (if any).
ja: True または 1：キーボードフックは、ここから次に現れる#UseHook Falseまでの間、すべてのキーボードホットキーを実装するために使われます。

source: Type: A character from the type table below indicating how the input value should be interpreted.
ja: Type：入力値がどのように解釈されるべきかを示す、以下のタイプテーブルからの文字。

source: TypeError: An unexpected type of value was used as input for a function, property assignment, or some other operation.
ja: TypeError：関数、プロパティの割り当て、またはその他の操作の入力として、予期しないタイプの値が使用されました。

source: U: Release the mouse button (i.e. generate an up-event).
ja: U：マウスボタンを離す（つまりアップイベントを発生させます）。

source: U: Removes duplicate items from the list so that every item is unique.
ja: U：リストから重複する項目を削除し、すべての項目が一意になるようにします。

source: UPX official website (downloads and information):
ja: UPX公式サイト（ダウンロードと情報）：

source: UPX official website (downloads and information): https://upx.github.io/
ja: UPX公式サイト（ダウンロードと情報）：https://upx.github.io/

source: UTF-16-RAW: As above, but no byte order mark is written when a new file is created.
ja: UTF-16-RAW：上記と同様ですが、新規ファイル作成時にバイトオーダーマークを付与しません。

source: UTF-8-RAW: As above, but no byte order mark is written when a new file is created.
ja: UTF-8-RAW：上記と同様ですが、新規ファイル作成時にバイトオーダーマークを付与しません。

source: Unary minus (-): Inverts the sign of its operand.
ja: 単項マイナス（-）：オペランドの符号を反転します。

source: Unary plus (+): +N is equivalent to -(-N).
ja: 単項プラス（+）： +Nは -(-N)と等価。

source: Uni: Unidirectional sort.
ja: Uni：単方向のソートです。

source: Unicode: Each character is two bytes (16 bits).
ja: Unicode：各文字は2バイト（16ビット）です。

source: Unreachable: Before the script starts to run, show a warning for each line that immediately follows a Return, Break, Continue, Throw or Goto at the same nesting level, unless that line is the target of a label.
ja: Unreachable：スクリプトの実行を開始する前に、同じネスティングレベルのReturn、Break、Continue、Throw、Gotoの直後の各行について、その行がラベルの対象でない限り、警告を表示するようにします。

source: UnsetError: An attempt was made to read the value of a variable, property or item, but there was no value.
ja: UnsetError：変数、プロパティ、アイテムの値を読み取ろうとしたが、値がありませんでした。

source: Using MsgBox with GUI windows: A GUI window may display a modal message box by means of the OwnDialogs option.
ja: GUIウィンドウでMsgBoxを使用：GUIウィンドウは、OwnDialogsオプションにより、モーダルメッセージボックスを表示することができる。

source: Using MsgBox with GUI windows:
ja: GUIウィンドウでMsgBoxを使用：

source: V: Sets VisibleText and VisibleNonText to 1 (true).
ja: V：VisibleText、VisibleNonTextを1 (true)に設定します。

source: V: Sets the control's Name.
ja: V：コントロールのNameを設定します。

source: VScroll: Provides a vertical scroll bar if appropriate for this type of control.
ja: VScroll：このタイプのコントロールに適している場合、垂直スクロールバーを提供します。

source: Value: Any value to assign to the property.
ja: Value：プロパティに割り当てる任意の値。

source: ValueError: An unexpected value was used as input for a function, property assignment, or some other operation.
ja: ValueError：予期せぬ値が、関数やプロパティの割り当て、その他の操作の入力として使用されました。

source: VarUnset: Before the script starts to run, display a warning for the first reference to each variable which is never used in any of the following ways:
ja: VarUnset：スクリプトの実行を開始する前に、次のいずれにも使用されることのない各変数の最初の参照に対して警告を表示します：

source: Vis: Ensures that the item is completely visible by scrolling the TreeView and/or expanding its parent, if necessary.
ja: Vis：必要に応じて、TreeViewをスクロールしたり、親を展開したりして、アイテムが完全に表示されるようにします。

source: Vis: Ensures that the specified row is completely visible by scrolling the ListView, if necessary.
ja: Vis：必要に応じて ListView をスクロールさせ、指定した行が完全に表示されるようにする。

source: VisFirst: Same as above except that the TreeView is also scrolled so that the item appears at the top, if possible.
ja: VisFirst：上記と同じですが、TreeViewもスクロールされ、可能であればアイテムが一番上に表示されます。

source: W: Weight (boldness), which is a number between 1 and 1000 (400 is normal and 700 is bold).
ja: W：ウェイト（太字）、1～1000の数値（400が普通、700が太字）。

source: Wn and Hn: The width and height of the dialog's client area, which excludes the title bar and borders.
ja: Wn、Hn：タイトルバーとボーダーを除いたダイアログのクライアント領域の幅と高さを指定します。

source: Wn and Hn: The width and height to load the image at, where n is an integer.
ja: Wn、Hn：画像を読み込む幅と高さを指定します。nは整数です。

source: Wn: Specify for n the width (in pixels) of the window's client area (the client area excludes the window's borders, title bar, and menu bar).
ja: Wn：ウィンドウのクライアント領域の幅（ピクセル）をnに指定する（クライアント領域はウィンドウのボーダー、タイトルバー、メニューバーを除く）。

source: Wn: Width of rectangle or ellipse.
ja: Wn：矩形または楕円の幅。

source: WantF2: Specify -WantF2 (minus WantF2) to prevent F2 from editing the currently focused row.
ja: WantF2：F2が現在フォーカスしている行を編集できないようにするには、-WantF2（マイナスWantF2）を指定する。

source: WantF2: Specify -WantF2 (minus WantF2) to prevent F2 from editing the currently selected item.
ja: WantF2： -WantF2（マイナスWantF2）を指定すると、F2が現在選択されている項目を編集できないようにする。

source: Warning: Changing the input parameters of RegExReplace or RegExMatch during a call is unsupported and may cause unpredictable behaviour.
ja: 警告呼び出し中にRegExReplaceまたはRegExMatchの入力パラメータを変更することはサポートされておらず、予測不可能な動作を引き起こす可能性があります。

source: Warning: Combining vk and sc in this manner is valid only with Send.
ja: 警告：この方法でvkとscを組み合わせることは、Sendの場合のみ有効です。

source: Warning: Deleting from the registry is potentially dangerous - please exercise caution!
ja: 警告： レジストリからキーを削除することは危険を伴うことがあります。慎重に実行してください！

source: Warning: Hotkeys and Send have some differences that you should be aware of.
ja: 警告：ホットキーと送信には、注意しなければならない違いがあります。

source: Warning: Only Send, GetKeyName, GetKeyVK, GetKeySC and A_MenuMaskKey support combining VKnn and SCnnn.
ja: 警告：VKnnとSCnnnの組み合わせに対応しているのは、Send関数、GetKeyName関数、GetKeyVK関数、GetKeySC関数、A_MenuMaskKeyのみです。

source: Warning: SendInput does not support key delays, nor does Send by default.
ja: 警告：SendInputは、キー遅延をサポートしておらず、デフォルトのSendもサポートしていません。
